app/views/menus/index.html.erb

    <section class="MenuPage__listing">
        <% Menu.all.order(:name).each do |menu| %>
---
SELECT "menus".* FROM "menus" ORDER BY "menus"."name" ASC