app/views/menus/index.html.erb

SELECT "menus".* FROM "menus"
---
    <section class="MenuPage__listing">
        <% Menu.all.each do |menu| %>