app/views/cart_items/new.html.erb

SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."menu_id" = $1  [["menu_id", 9]]
---
        <% @menus.each do |menu| %>
          <% if !menu.menu_item.empty? %>