app/controllers/application_controller.rb

  def current_user
    # Return current user or nil if there's no session
    # Use memoization
    return @current_user if @current_user

    # If set, must be a valid user. Already authenticated before setting sessions hash
    if session[:current_user_id]
      @current_user = User.find(session[:current_user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]