app/controllers/cart_items_controller.rb

    def index
        cart = current_user.cart_item
        @expired_items = cart.inactive_now.order(:created_at)
        @cart_items = cart.active_now.order(:created_at)
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."user_id" = $1 AND (menu_item_id IN (6,7,8)) ORDER BY "cart_items"."created_at" ASC  [["user_id", 2]]

    def create
        cart_item = CartItem.new(
            user_id: current_user.id,
            menu_item_id: params[:menu_id],
            quantity: 1
        )
        if(!cart_item.save)
---
INSERT INTO "cart_items" ("user_id", "menu_item_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["menu_item_id", 6], ["created_at", "2021-02-11 20:43:07.077953"], ["updated_at", "2021-02-11 20:43:07.077953"]]

    def update
        cart_item = current_user.cart_item.find_by(id: params[:id])
        if(cart_item)
            if(params[:change].eql?("add"))
                cart_item.quantity += 1
            elsif(params[:change].eql?("remove"))
                cart_item.quantity -= 1
            end

            if(cart_item.quantity==0)
                cart_item.destroy()
            elsif(!cart_item.save)
---
SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."user_id" = $1 AND "cart_items"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 16], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = $1  [["id", 16]]
UPDATE "cart_items" SET "quantity" = $1, "updated_at" = $2 WHERE "cart_items"."id" = $3  [["quantity", 2], ["updated_at", "2021-02-11 20:35:20.224636"], ["id", 14]]

    def destroy
        cart_item = current_user.cart_item.find_by(id: params[:id])
        if(cart_item)
            cart_item.destroy
---
SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."user_id" = $1 AND "cart_items"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 14], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = $1  [["id", 14]]