app/controllers/cart_items_controller.rb

SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def update
        cart_item = current_user.cart_item.find_by(id: params[:id])