app/controllers/items_controller.rb

INSERT INTO "items" ("name", "description", "diet_type") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Burger"], ["description", "Done"], ["diet_type", "egg"]]
---
    def create
        # POST /items
        item = Item.new(
            name: params[:name],
            description: params[:description],
            diet_type: params[:diet_type]
        )
        if(item.save)

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def select
        # POST /items/select
        params[:item_id].each do |id|
            item = Item.find_by(id: id)