app/controllers/menus_controller.rb

  def show
    if !session[:update_menu_items_selection]
      session[:update_menu_items_selection] = Hash({})
    end
    menu = Menu.find_by(id: params[:id])
---
SELECT "menus".* FROM "menus" WHERE "menus"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]