app/controllers/menus_controller.rb

  def create
    # POST /menus
    menu = Menu.new(name: params[:name])
    if (!menu.save)
      helpers.add_error_flash(menu.errors.full_messages)
      redirect_to new_menu_path
    else
        # Create and link menu items
        has_failed = false
        params[:items].each do |item_id, item_price|
          menu_item = MenuItem.new(item_id: item_id.to_i,
                                   menu_id: menu.id,
                                   price: item_price)
          if (!menu_item.save)
---
INSERT INTO "menus" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Brunch"], ["created_at", "2021-02-10 17:01:37.545774"], ["updated_at", "2021-02-10 17:01:37.545774"]]
INSERT INTO "menu_items" ("menu_id", "item_id", "price") VALUES ($1, $2, $3) RETURNING "id"  [["menu_id", 5], ["item_id", 1], ["price", "20.0"]]

  def update
      # UPDATE /menus/:id
      menu = Menu.find_by(id: params[:id])
      if(menu)
          Menu.deactivate_all
          menu.is_active = true;
          menu.save
---
SELECT "menus".* FROM "menus" WHERE "menus"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "menus" SET "is_active" = $1, "updated_at" = $2 WHERE "menus"."id" = $3  [["is_active", true], ["updated_at", "2021-02-10 19:42:19.857630"], ["id", 8]]