app/controllers/orders_controller.rb

INSERT INTO "orders" ("user_id", "total_price") VALUES ($1, $2) RETURNING "id"  [["user_id", 2], ["total_price", "60.0"]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."user_id" = $1 AND (menu_item_id IN (6,7,8))  [["user_id", 2]]
INSERT INTO "order_items" ("order_id", "menu_item_id", "quantity") VALUES ($1, $2, $3) RETURNING "id"  [["order_id", 2], ["menu_item_id", 8], ["quantity", 3]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = $1  [["id", 24]]
---
    def create
        order = Order.new(
            user_id: current_user.id,
            total_price: params[:total_price]
        )
        cart_items = current_user.cart_item.active_now
        # As an improvement, report items that may have expired during this step
        if(!cart_items)
            helpers.add_error_flash("Cart is empty")
        elsif(!order.save)
            helpers.add_error_flash(order.errors.full_messages)
        else
            # Create order items
            has_error = false
            cart_items.each do |c_item|
                order_item = OrderItem.new(
                    order_id: order.id,
                    menu_item_id: c_item.menu_item.id,
                    quantity: c_item.quantity
                )
                if(!order_item.save)
                    has_error = true
                    next
                else
                    c_item.destroy

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1 AND "orders"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 2], ["LIMIT", 1]]
SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 1]]
---
    def show
        # GET /order/[:id]
        @order = current_user.order.find_by(id: params[:id])
        if(@order)
            @order_items = @order.order_item