app/controllers/orders_controller.rb

  def search
    # POST /orders/search
    start_date = params[:start_date]
    end_date = params[:end_date]
    status = params[:status]
    @orders = current_user.order.
                          after(start_date).
                          upto(end_date).
                          send(status.to_sym).
                          order(created_at: :DESC)
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]