app/controllers/users_controller.rb

INSERT INTO "users" ("firstname", "lastname", "email", "password_digest", "mobile_num") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["firstname", "Last"], ["lastname", ""], ["email", "last@g.c"], ["password_digest", "$2a$12$aF2c6il.yAkmd2pjnNycXeqftwJgPYyYuZkl0fWUQ5BtxKuoxkZY6"], ["mobile_num", ""]]
---
    def create
      # POST /users
      user = User.new(
        firstname: params[:firstname],
        lastname: params[:lastname],
        email: params[:email],
        mobile_num: params[:mobile],
        password: params[:password],
      )
      # Login user upon successful signup
      if (user.save)