app/models/cart_item.rb

SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."menu_id" = $1  [["menu_id", 9]]
---
    def is_active?
        menu_item.menus.where(is_active: true)>0 ? true : false