app/models/item.rb

    def self.not_selected_for_new_menu(selected_items)
        selected_ids = selected_items.keys.map(&:to_i)
---
SELECT "items".* FROM "items"