app/models/menu_item.rb

    def cart_id_for_user(current_user)
        item = cart_item.find_by(user_id: current_user.id)
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."menu_item_id" = $1 AND "cart_items"."user_id" = $2 LIMIT $3  [["menu_item_id", 6], ["user_id", 2], ["LIMIT", 1]]

    def quantity_for_user(current_user)
        item = cart_item.find_by(user_id: current_user.id)
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."menu_item_id" = $1 AND "cart_items"."user_id" = $2 LIMIT $3  [["menu_item_id", 6], ["user_id", 2], ["LIMIT", 1]]