app/models/menu.rb

SELECT "menus".* FROM "menus" WHERE "menus"."is_active" = $1 LIMIT $2  [["is_active", true], ["LIMIT", 1]]
---
  def self.active_menu
      all.find_by(is_active: true)

UPDATE "menus" SET "is_active" = $1, "updated_at" = $2 WHERE "menus"."id" = $3  [["is_active", false], ["updated_at", "2021-02-10 19:49:51.823542"], ["id", 8]]
---
  def self.deactivate_all
      active_menus.each do |menu|
          menu.is_active = false;
          menu.save